src/InformationRegisters/СведенияОПрочтении/СведенияОПрочтении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7065147c-9d8a-4918-9fe9-9c5ce454f820">
  <name>СведенияОПрочтении</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="98c46a89-eee9-43b3-835b-5e2d3a9eb47e">
    <name>Прочтен</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions extendedConfigurationObject="24295aae-60d2-4fc7-8380-46f02591ede0">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="5cf2317a-8ebe-4756-b467-b9c4b6b126c6">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СД_СвязьСЗадачами/СД_СвязьСЗадачами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f807aa71-443d-46de-9f9f-d28ea4d66cce">
  <name>СД_СвязьСЗадачами</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="9406a302-87c4-4c43-b381-5377095c4ec3">
    <name>Задача</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="477dcebf-96d7-4cee-a29b-d2bb71f0a53f">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СД_ПараметрыЗаявок/СД_ПараметрыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="16514a81-a9f2-4b58-a555-5f1b831bc014">
  <name>СД_ПараметрыЗаявок</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="cd8ff465-433f-4be0-8240-0612861308f3">
    <name>ЗначениеПараметра</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Characteristic.СД_ПараметрыЗаявок</types>
    </type>
  </resources>
  <dimensions extendedConfigurationObject="b1996d7d-951d-4cb6-bc78-d0747c2c6125">
    <name>Заявка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_Заявка</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="0d2e0fe2-e9e3-4237-9a9d-7e7bcb4443f0">
    <name>ПараметрЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ChartOfCharacteristicTypesRef.СД_ПараметрыЗаявок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыТекстовПочтовыхСообщений/ТипыТекстовПочтовыхСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e7c7dbf5-5bd3-4bde-9c6b-619e9ce210e9">
  <name>ТипыТекстовПочтовыхСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="867deec6-1180-4f91-b6e0-ca0072776d06">
    <name>ПростойТекст</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="641ed845-b9f2-4b79-9b04-519e11033b6a">
    <name>HTML</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4401d66a-ee6d-4e45-a9b0-a9caf8244690">
    <name>РазмеченныйТекст</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Enums/СД_СтатусыЗаявок/СД_СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fa383933-9934-4bdb-acf3-26c3446dfa9c">
  <name>СД_СтатусыЗаявок</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="3157dd06-af9a-4834-8c77-623a69d02353">
    <name>Закрыта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Documents/ВходящееПисьмо/ВходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c26824c8-10ee-440b-a219-6e1336983937">
  <name>ВходящееПисьмо</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6b7b6d2a-3191-4f37-be6c-fe995b962aad">
    <name>ОтправительАдресат</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="27e2a85c-dfb6-4bc4-9e2d-31e28adfef79">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="aaa92917-d1d1-4a7c-a0df-feb9c71a5efc">
    <name>УчетнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="96f67e35-204f-49be-a7d4-81e2f6845073">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="81877874-cff0-4aea-a447-68f20bd43e31">
    <name>ТекстПисьмаРазмеченныйТекстХранилище</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="7b21f03a-d7f1-4504-a8fc-6dbff1f4cab8">
    <name>ТекстПисьмаПростойТекстХранилище</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="eb4496ec-620b-4327-8bea-2c7a16dfa7d5">
    <name>ТекстПисьмаHTMLХранилище</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="90293809-a598-47f8-9b2a-4d20cd92ab1e">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="22f821c4-f11a-4a99-9b32-287a1c7de638">
    <name>Кодировка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="3b1eac58-470c-4b9d-9c82-f7f1c2a1c4cf">
    <name>ДатаОтправки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e5e79887-02ab-47ed-915f-4f3f20ed5ebc">
    <name>Размер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="ded4bb6e-b410-4347-9a47-dd48b4424f88">
    <name>ИдентификаторСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="108798bb-6424-4567-97d0-0f055837fc79">
    <name>ТипТекста</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/СД_Решение/СД_Решение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4e563ab8-0bdb-41e4-81d0-c03cd64d25cd">
  <name>СД_Решение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="374a73c0-8dbb-40a3-ab9c-9ccbbb7606ca">
    <name>Заявка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_Заявка</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="3d4e4238-0c03-4a83-bea5-4c89b4b16490">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="2d67b1c9-8e01-4d59-ba84-cf58126dddc9">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b0e92f9d-493f-4133-bb14-24268d71da8d">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="773ad657-a817-41bb-8f20-9a6149bc5053">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/СД_Заявка/СД_Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="dd884d26-cef7-4ee5-928a-cf898ed269f2">
  <name>СД_Заявка</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="15f46283-54f7-48ef-a5e8-9eb85aff1153">
    <name>ТемаЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="325efba9-8467-4c2f-85f3-3616245ff630">
    <name>Сервис</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_Сервисы</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e5d59f79-79c9-4f7c-81e1-c7baed11fecb">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СД_СпособыСоздания</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="40d006d1-31b1-4c03-b927-2f3e3232f015">
    <name>ИннициаторЗаявкиАдресЭлПочты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="82253011-7877-4f03-8b69-9b94f487a8f8">
    <name>Примечание</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ef42f5f-532d-4072-8a34-c052799b6365">
    <name>ВидЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ВидыЗаявок</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="75e52cec-543a-4143-bffb-a75f2b219550">
    <name>ИннициаторЗаявкиИмяОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="759a06b0-6d20-49ce-bed2-5a470e74ff85">
    <name>УчетнаяЗаписьПолученияЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="263baaae-a575-4f3e-9970-96da3c1d4231">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="87523878-293d-4a0b-80f8-26e341f648ce">
    <name>ИнициаторЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="7634e8d6-85ec-4663-8376-d377e2c7870d">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="1479f7d5-6902-4658-a27e-fc569da4b92d">
    <name>ПродолжениеЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_Заявка</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8c420815-9453-413a-8229-a2fdba058602">
    <name>ПроблемаИнцидент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_ПроблемаИнцидент</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f6697eea-c58d-4fca-920f-7aafd944fc4d">
    <name>ОборудованиеПредприятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ОборудованиеПредприятия</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="29031e78-6fa3-4c0c-947c-5470ffd8e2ec">
    <name>Ч_ТипЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.Ч_ТипыЗаявокСД</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8409f1b3-8158-4a7e-b764-2c99f6de21f9">
    <name>Ч_ПлановоеВремяЗакрытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="11dd4a2c-ef4b-4e51-a146-5fcd125305f8">
    <name>Ч_Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
    </type>
  </attributes>
</mdclass:Document>

src/CommonModules/СД_ИнтернетШлюзСервер/Module.bsl
&Вместо("ОбработатьМониторингЭлектроннойПочты")
Процедура ЧСД_ОбработатьМониторингЭлектроннойПочты()
	//ПродолжитьВызов();
	//Возврат;
	//
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ Константы.СД_ИнтеграцияСЭлПочтой.Получить() Тогда
		Возврат;
	КонецЕсли;

	КоличествоСозданныхОбъектов = 0;
	УчетнаяЗаписьМониторинга = "";
	
	//ТаблицаЗаголовков = ПолучитьТаблицуЗаголовковВходящихСообщенийВнутреннейПочты();
	
	//сформируем таблицу для загрузки пояснений по уже существующим заявкам
	ТаблицаПоясненийКСуществующимЗаявкам = Новый ТаблицаЗначений;
	ТаблицаПоясненийКСуществующимЗаявкам.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.СД_Заявка"));
	ТаблицаПоясненийКСуществующимЗаявкам.Колонки.Добавить("UID", Новый ОписаниеТипов("ДокументСсылка.ВходящееПисьмо"));
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СД_МониторингЭлПочты.Ссылка КАК СсылкаНаМониторинг,
	                    |	СД_МониторингЭлПочты.УчетнаяЗаписьПриемаЭлПочты КАК УчетнаяЗаписьМониторинга,
	                    |	СД_МониторингЭлПочты.СервисТехПоддержки КАК СервисТехПоддержки,
	                    |	ВходящееПисьмо.ОтправительАдресат КАК Отправитель,
	                    |	ВходящееПисьмо.ОтправительАдресат КАК ИмяОтправителя,
	                    |	ВходящееПисьмо.Тема КАК Тема,
	                    |	СведенияОПрочтении.Прочтен КАК Прочтен,
	                    |	ВходящееПисьмо.Важность КАК Важность,
	                    |	ВходящееПисьмо.Кодировка КАК Кодировка,
	                    |	ВходящееПисьмо.Ссылка КАК UID,
	                    |	ВходящееПисьмо.ДатаОтправки КАК ДатаОтправления,
	                    |	ВходящееПисьмо.Размер КАК Размер,
	                    |	ВходящееПисьмо.ИдентификаторСообщения КАК ИдентификаторСообщения,
	                    |	ВходящееПисьмо.ТипТекста КАК ТипТекста,
	                    |	ВЫБОР
	                    |		КОГДА ВходящееПисьмо.ТипТекста = ЗНАЧЕНИЕ(Перечисление.ТипыТекстовПочтовыхСообщений.ПростойТекст)
	                    |			ТОГДА ВходящееПисьмо.ТекстПисьмаПростойТекстХранилище
	                    |		КОГДА ВходящееПисьмо.ТипТекста = ЗНАЧЕНИЕ(Перечисление.ТипыТекстовПочтовыхСообщений.HTML)
	                    |			ТОГДА ВходящееПисьмо.ТекстПисьмаHTMLХранилище
	                    |		ИНАЧЕ ВходящееПисьмо.ТекстПисьмаРазмеченныйТекстХранилище
	                    |	КОНЕЦ КАК ТекстПисьмаХранилище,
	                    |	ВходящееПисьмо.Представление КАК Представление,
	                    |	СД_Сервисы.Ч_ПользовательПочты КАК ПользовательПочты
	                    |ИЗ
	                    |	Справочник.СД_МониторингЭлПочты КАК СД_МониторингЭлПочты
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящееПисьмо КАК ВходящееПисьмо
	                    |			ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ТипыТекстовПочтовыхСообщений КАК ТипыТекстовПочтовыхСообщений
	                    |			ПО ВходящееПисьмо.ТипТекста = ТипыТекстовПочтовыхСообщений.Ссылка
	                    |		ПО СД_МониторингЭлПочты.УчетнаяЗаписьПриемаЭлПочты = ВходящееПисьмо.УчетнаяЗапись
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СД_Сервисы КАК СД_Сервисы
	                    |		ПО СД_МониторингЭлПочты.СервисТехПоддержки = СД_Сервисы.Ссылка
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПрочтении КАК СведенияОПрочтении
	                    |		ПО (ВходящееПисьмо.Ссылка = СведенияОПрочтении.Объект)
	                    |			И (СД_Сервисы.Ч_ПользовательПочты = СведенияОПрочтении.Пользователь)
	                    |ГДЕ
	                    |	СД_МониторингЭлПочты.ПометкаУдаления = ЛОЖЬ
	                    |	И СД_МониторингЭлПочты.Включен = ИСТИНА
	                    |	И ЕСТЬNULL(СведенияОПрочтении.Прочтен, ЛОЖЬ) = ЛОЖЬ
	                    |	И ВходящееПисьмо.ОтправительАдресат.Адрес <> СД_МониторингЭлПочты.УчетнаяЗаписьПриемаЭлПочты.Наименование");

	СтрокаЗаголовка = Запрос.Выполнить().Выбрать();


	//обработаем таблицу заголовков для каждого мониторинга
	Пока СтрокаЗаголовка.Следующий() Цикл
		
		ОтправительАдресЭП=СД_ИнтернетШлюзСервер.ПолучитьАдресЭПИзСтрокиЭлектронногоАдреса(СтрокаЗаголовка.Отправитель);
		УчетнаяЗаписьМониторинга = СтрокаЗаголовка.УчетнаяЗаписьМониторинга;

		Если НРег(ОтправительАдресЭП)=НРег(УчетнаяЗаписьМониторинга.АдресЭлектроннойПочты) Тогда
			//исключим обработку собственных писем, чтобы не войти в бесконечный цикл обработки своих же уведомлений
			ЗафиксироватьОбработкуПисьма(СтрокаЗаголовка, УчетнаяЗаписьМониторинга);
			Продолжить;
		КонецЕсли;
 
		ТемаПисьма=СтрокаЗаголовка.Тема;

		//проверим тему письма на нахождение в ней тикета существующей заявки
		ТикетЗаявки=СД_ИнтернетШлюзСервер.ПолучитьТикетИзТемыПисьма(ТемаПисьма);
		Если НЕ ПустаяСтрока(ТикетЗаявки) Тогда
			ЗаявкаСсылка=СД_ОбщееВызовСервера.ПолучитьЗаявкуПоТикету(ТикетЗаявки);
			Если ЗначениеЗаполнено(ЗаявкаСсылка) Тогда
			//	СтрокаЗаголовка.Принимать=Истина;
				СтрокаТЧ=ТаблицаПоясненийКСуществующимЗаявкам.Добавить();
				СтрокаТЧ.Заявка=ЗаявкаСсылка;
				СтрокаТЧ.UID=СтрокаЗаголовка.UID;
				//Продолжить;
			Иначе
				//тикет был найден, но для него нет заявки
				СД_ИнтернетШлюзСервер.ОтправитьОшибкуВТикете(ОтправительАдресЭП, ТикетЗаявки, УчетнаяЗаписьМониторинга, ТемаПисьма, СтрокаЗаголовка.СсылкаНаМониторинг); 
				СД_ОбщееВызовСервера.ЗаписатьОшибку("По тикету "+ТикетЗаявки+" не найдена заявка. Пояснение не загружено");				
				ЗафиксироватьОбработкуПисьма(СтрокаЗаголовка, УчетнаяЗаписьМониторинга);					
				Продолжить;						
			КонецЕсли;
		КонецЕсли;

		Если СтрокаЗаголовка.СсылкаНаМониторинг.ТипОбработки=Перечисления.СД_ТипыОбработкиИнтернетШлюза.ПриниматьОтЗарегистрированных Тогда
			//проверим, есть ли такой отправитель в нашей базе					
			Если НЕ СД_ИнтернетШлюзСервер.ОтправительЗарегистрирован(ОтправительАдресЭП) Тогда
				//отправим отказ инициатору
				СД_ИнтернетШлюзСервер.ОтправитьОтказРегистрацииТикета(ОтправительАдресЭП, УчетнаяЗаписьМониторинга, ТемаПисьма, СтрокаЗаголовка.СсылкаНаМониторинг); 
				СД_ОбщееВызовСервера.ЗаписатьОшибку("Адрес эл. почты "+ОтправительАдресЭП+" не зарегистрирован в справочниках. Письмо отклонено.");				
				ЗафиксироватьОбработкуПисьма(СтрокаЗаголовка, УчетнаяЗаписьМониторинга);			
				Продолжить;
			КонецЕсли;

		КонецЕсли;

		//
		СтрокаПисьма = Новый Структура();
		СтрокаПисьма.Вставить("UID", СтрокаЗаголовка.UID);
		СтрокаПисьма.Вставить("СвязьСБазойДанных", ПолучитьСвязьСБазойДанныхПоАдресуЭлПочты(ОтправительАдресЭП));
		СтрокаПисьма.Вставить("ИмяОтправителя", СтрокаЗаголовка.Отправитель);
		СтрокаПисьма.Вставить("Тема", СтрокаЗаголовка.Тема);
		СтрокаПисьма.Вставить("ДатаОтправления", СтрокаЗаголовка.ДатаОтправления);
		СтрокаПисьма.Вставить("ОбратныйАдрес", ОтправительАдресЭП);
		СтрокаПисьма.Вставить("Отправитель", СтрокаЗаголовка.Отправитель);
		СтрокаПисьма.Вставить("Кодировка", СтрокаЗаголовка.Кодировка);
		СтрокаПисьма.Вставить("Размер", СтрокаЗаголовка.Размер);
		СтрокаПисьма.Вставить("ПользовательПочты", СтрокаЗаголовка.ПользовательПочты);
		
		//РеквизитыПисьма = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаЗаголовка.UID, 
		//	"ТипТекста, Ссылка, ТекстПисьмаHTMLХранилище, ТекстПисьмаПростойТекстХранилище, Кодировка, ОтправительАдресат, ДатаОтправки, Тема, ПолучателиПисьма, ПолучателиКопий, Дата, ВнутреннийЗаголовок, Важность, Комментарий");

		Текст = СтрокаЗаголовка.ТекстПисьмаХранилище.Получить();
		Тексты = новый массив;
		Тексты.Добавить(Новый Структура("ТипТекста,Текст,Кодировка,Данные", СтрокаЗаголовка.ТипТекста, Текст, СтрокаЗаголовка.Кодировка, Текст));
		СтрокаПисьма.Вставить("Тексты", Тексты);
		
		
		ФайлыПисьма = ВстроеннаяПочтаСервер.ПолучитьФайлыПисьма(
			СтрокаЗаголовка.UID, // Письмо
			Истина, // ФормироватьРазмерПредставление
			Ложь, // ВключатьПомеченныеНаУдаление
			Ложь,    // ТолькоСИдентификаторами
			Истина); // ТолькоБезИдентификаторов  - чтобы картинки в HTML не показывать
			
		Вложения = Новый Массив;
		Для каждого ФайлыПисьмаСтрока Из ФайлыПисьма Цикл
			
			ДанныеФайла = РаботаСФайламиВызовСервера.ПолучитьДвоичныеДанныеВерсииФайла(ФайлыПисьмаСтрока.ТекущаяВерсия);
			Вложения.Добавить(Новый Структура("Ключ,Значение", ФайлыПисьмаСтрока.Представление, ДанныеФайла));
			
		КонецЦикла;
		СтрокаПисьма.Вставить("Вложения", Вложения);
		
		Если ЗначениеЗаполнено(ЗаявкаСсылка) Тогда
			ОбъектСоздан=СоздатьПояснениеКЗаявке(СтрокаПисьма, СтрокаЗаголовка.УчетнаяЗаписьМониторинга, ЗаявкаСсылка, СтрокаЗаголовка.СсылкаНаМониторинг);
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			                    |	СД_Решение.Ссылка КАК Документ,
			                    |	СД_Решение.Автор КАК Автор,
			                    |	СД_Решение.Дата КАК Дата,
			                    |	СД_СвязьСЗадачами.Задача КАК Задача,
			                    |	СД_СвязьСЗадачами.Задача.Выполнена КАК Выполнена,
			                    |	СД_ПараметрыЗаявок.ЗначениеПараметра КАК СтатусЗаявки
			                    |ИЗ
			                    |	Документ.СД_Решение КАК СД_Решение
			                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СД_СвязьСЗадачами КАК СД_СвязьСЗадачами
			                    |		ПО (СД_СвязьСЗадачами.Документ = СД_Решение.Ссылка)
								|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СД_ПараметрыЗаявок.СрезПоследних(, ПараметрЗаявки = &ПараметрЗаявкиСтатус) КАК СД_ПараметрыЗаявок
								|		ПО (СД_ПараметрыЗаявок.Заявка = СД_Решение.Заявка)
			                    |ГДЕ
			                    |	СД_Решение.ПометкаУдаления = ЛОЖЬ
			                    |	И СД_Решение.Заявка = &Заявка
			                    |
			                    |УПОРЯДОЧИТЬ ПО
			                    |	СД_Решение.Дата УБЫВ");
	
			Запрос.УстановитьПараметр("Заявка", ЗаявкаСсылка);
			Запрос.УстановитьПараметр("ПараметрЗаявкиСтатус", ПланыВидовХарактеристик.СД_ПараметрыЗаявок.СтатусЗаявки);
			Данные = Запрос.Выполнить().Выбрать();
			Если Данные.Следующий() Тогда
				РегистрыСведений.ОчередьУведомлений.ДобавитьУведомление(
					Данные.Автор,
					Справочники.ВидыБизнесСобытий.ПолучениеВходящегоПисьма,
					Перечисления.СпособыУведомления.ПоПочте,
					СтрокаЗаголовка.UID,
					СтрокаЗаголовка.UID,
					"Поступило новое пояснение к заявке " + Строка(ЗаявкаСсылка));
					
				// Добавить обработку, если Заявка закрыта, то открыть
				Если Данные.СтатусЗаявки = ПредопределенноеЗначение("Перечисление.СД_СтатусыЗаявок.Закрыта") Тогда
					
					УстанавливаемыйСтатусЗаявки=ПредопределенноеЗначение("Перечисление.СД_СтатусыЗаявок.РешениеПодготовлено");
					
					СохранитьСтруктуруСостоянияЗаявки(ЗаявкаСсылка, УстанавливаемыйСтатусЗаявки, СтрокаЗаголовка.UID);
				КонецЕсли;
				
			КонецЕсли;
				
				
		Иначе
			ОбъектСоздан=СоздатьЗаявкуТехПоддержкиПоПисьму(СтрокаПисьма, СтрокаЗаголовка.УчетнаяЗаписьМониторинга, СтрокаЗаголовка.СсылкаНаМониторинг);
		КонецЕсли;

		Если ОбъектСоздан Тогда
			РегистрыСведений.СведенияОПрочтении.УстановитьСведенияОПрочтении(СтрокаЗаголовка.UID, Истина, СтрокаЗаголовка.ПользовательПочты);
			КоличествоСозданныхОбъектов=КоличествоСозданныхОбъектов+1;
		КонецЕсли;
		
	КонецЦикла; //по таблице заголовков


	ЗаписьЖурналаРегистрации("Service Desk: Мониторинг почты", УровеньЖурналаРегистрации.Информация, , УчетнаяЗаписьМониторинга, "Мониторинг завершен. Количество созданных объектов: "+Формат(КоличествоСозданныхОбъектов,"ЧЦ=15; ЧДЦ=0; ЧН=" ));	

КонецПроцедуры

&Вместо("МониторингЭлектроннойПочты")
Процедура ЧСД_МониторингЭлектроннойПочты()
	// Вставить содержимое метода.
	ЧСД_ОбработатьМониторингЭлектроннойПочты();
КонецПроцедуры

&Вместо("СоздатьЗаявкуТехПоддержкиПоПисьму")
Функция ЧСД_СоздатьЗаявкуТехПоддержкиПоПисьму(СтрокаПисьма, УчетнаяЗапись, ЭлементМониторинга)
		УстановитьПривилегированныйРежим(Истина);
	
	ИнициаторЗаявки=СтрокаПисьма.СвязьСБазойДанных;
	СервисТехПоддержки=ЭлементМониторинга.СервисТехПоддержки;
	ОтправительАдресЭП=СД_ИнтернетШлюзСервер.ПолучитьАдресЭПИзСтрокиЭлектронногоАдреса(СтрокаПисьма.Отправитель);
	
	Если Константы.СД_ИспользоватьЛимитыОбращений.Получить() Тогда
		//проверим лимиты обращений
		ОшибкаЛимита=СД_ОбщееВызовСервера.ЗаявкаВходитВЛимит(ИнициаторЗаявки, СервисТехПоддержки);
		Если НЕ ПустаяСтрока(ОшибкаЛимита) Тогда
			
			ТекстОшибки="Превышен лимит для: "+СокрЛП(ИнициаторЗаявки)+"; сервис: "+СокрЛП(СервисТехПоддержки)+" адресат "+ОтправительАдресЭП+": "+ОшибкаЛимита;			
			ЗаписьЖурналаРегистрации("Service Desk: Загрузка заявки из эл. почты", УровеньЖурналаРегистрации.Предупреждение, , УчетнаяЗапись, ТекстОшибки);
			ЗаписатьВЖурналИнтернетШлюза(ТекстОшибки, УчетнаяЗапись, ИнициаторЗаявки);
			ОтправитьОтказПревышениеЛимита(ОтправительАдресЭП, УчетнаяЗапись, "Re: "+СокрЛП(СтрокаПисьма.Тема)+" (превышен лимит обращений)", ЭлементМониторинга);
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	АвторСообщения=СД_ИнтернетШлюзСервер.ПолучитьАвтораСообщения(СокрЛП(ОтправительАдресЭП));
	КомментарийДокумента="Создано загрузкой из почты "+СокрЛП(УчетнаяЗапись)+" от адресата "+ОтправительАдресЭП+" "+СокрЛП(ТекущаяДата());

	ОтправительИмя=СтрокаПисьма.ИмяОтправителя;
	
	НовыйОбъект=Документы.СД_Заявка.СоздатьДокумент();
	НовыйОбъект.Сервис=СервисТехПоддержки;
	НовыйОбъект.ВидЗаявки=ЭлементМониторинга.ВидЗаявки;
	НовыйОбъект.Дата=СтрокаПисьма.ДатаОтправления;
	НовыйОбъект.ТемаЗаявки=СтрокаПисьма.Тема;
	НовыйОбъект.ИннициаторЗаявкиАдресЭлПочты=ОтправительАдресЭП;
	НовыйОбъект.ИннициаторЗаявкиИмяОтправителя=ОтправительИмя;
	НовыйОбъект.ИнициаторЗаявки=ИнициаторЗаявки;
	НовыйОбъект.СпособДоставки=Перечисления.СД_СпособыСоздания.ЭлектроннаяПочта;
	НовыйОбъект.УчетнаяЗаписьПолученияЗаявки=УчетнаяЗапись;
	НовыйОбъект.Примечание=КомментарийДокумента;
	НовыйОбъект.Ч_Предмет = СтрокаПисьма.UID;
	
	Если НЕ ЗначениеЗаполнено(НовыйОбъект.ИнициаторЗаявки) Тогда
		НовыйОбъект.ИнициаторЗаявки=СервисТехПоддержки.Ответственный;
	КонецЕсли;
	
	Если ПустаяСтрока(НовыйОбъект.ТемаЗаявки) Тогда
		НовыйОбъект.ТемаЗаявки="Импортированная заявка от "+СокрЛП(ОтправительАдресЭП);
	КонецЕсли;
	
	//установим содержимое документа
	Если СтрокаПисьма.Тексты.Количество()>0 Тогда
		ТекстСоответствие=СтрокаПисьма.Тексты[0];
		ТипТекста=ТекстСоответствие["ТипТекста"]; //строка "ПростойТекст" и т.д.
		ТекстСообщения=ТекстСоответствие["Текст"]; //текст сообщения
		
		Кодировка=ТекстСоответствие["Кодировка"]; //строка "windows-1251" и другие
		ИсходныеДанные=ТекстСоответствие["Данные"]; //исходные двоичные данные письма
		
		НовыйОбъект.ОписаниеЗаявкиТекст=ТекстСообщения;
		
	КонецЕсли;
	
	ОписаниеЗаявкиТекст=НовыйОбъект.ОписаниеЗаявкиТекст;
	ОписаниеЗаявкиТекст=СтрЗаменить(ОписаниеЗаявкиТекст, Символы.ПС, "<br>");
	
	ФормДокумент=Новый ФорматированныйДокумент;
	ФормДокумент.УстановитьHTML(ОписаниеЗаявкиТекст, Новый Структура);
	НовыйОбъект.ОписаниеЗаявкиХранилищеФорматированногоТекста=Новый ХранилищеЗначения(ФормДокумент);
		
	Попытка
		НовыйОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ТекстОшибки=ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Загрузка заявки тех. поддежрки из мониторинга почты", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;	
	
	ЗаявкаСсылка=НовыйОбъект.Ссылка;
	ЗаписьЖурналаРегистрации("Service Desk: Загрузка заявки из эл. почты", УровеньЖурналаРегистрации.Информация, , УчетнаяЗапись, "Успешно создан: "+СокрЛП(ЗаявкаСсылка));	
	
	ЗаписатьВЖурналИнтернетШлюза("Загружена заявка "+СокрЛП(ЗаявкаСсылка)+" с адреса "+ОтправительАдресЭП, УчетнаяЗапись, СтрокаПисьма.СвязьСБазойДанных);
	
	Если НЕ ПустаяСтрока(ОтправительИмя) 
		И (ТипЗнч(ЗаявкаСсылка.ИнициаторЗаявки)=Тип("СправочникСсылка.СД_ВнешниеКлиенты")) 
		И ПустаяСтрока(ЗаявкаСсылка.ИнициаторЗаявки.ИмяЗарегистрированногоПользователя) 
	Тогда
		//обновим данные
		СпрОбъект=ЗаявкаСсылка.ИнициаторЗаявки.ПолучитьОбъект();
		СпрОбъект.ИмяЗарегистрированногоПользователя=ОтправительИмя;
		Попытка
			СпрОбъект.Записать();
		Исключение
			СД_ОбщееВызовСервера.ЗаписатьОшибку(ОписаниеОшибки(),,Ложь);
		КонецПопытки;
	КонецЕсли;	
	
	Если ЭлементМониторинга.ЗагружатьВложения И СтрокаПисьма.Вложения.Количество()>0 Тогда
		
		ПапкаФайла=ЭлементМониторинга.ПапкаДляВложенныхФайлов;
					
		ТекСоответствие=СтрокаПисьма.Вложения;
		Для Каждого ЗначениеСоответствия Из ТекСоответствие Цикл
			ТемаПисьма=Строка(СтрокаПисьма.Тема);
			ИмяФайла=ЗначениеСоответствия.Ключ;
			ДвоичныеДанные=ЗначениеСоответствия.Значение;
			Если ПустаяСтрока(ИмяФайла) Тогда
				ТекстОшибки="Пустое имя файла вложения";
                ЗаписьЖурналаРегистрации("Service Desk: Загрузка заявки из эл. почты", УровеньЖурналаРегистрации.Ошибка, , ТемаПисьма, ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			Размер=ДвоичныеДанные.Размер();
			Комментарий="Заявка тех. поддержки """+ТемаПисьма+"""";
			СтруктураИмениФайла=СД_ОбщееВызовСервераПовтИсп.ПолучитьСтруктуруИмениФайла(ИмяФайла);
						
			//создадим файл где реквизит ВладелецФайлов будет равен значению ПапкаДляВложенныхФайлов мониторинга
			
			Если Не РасширениеФайлаРазрешеноДляЗагрузки(СтруктураИмениФайла.РасширениеФайла) Тогда
				СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Загрузка файлов с расширением ""%1"" запрещена. Обратитесь к администратору системы.'"), СтруктураИмениФайла.РасширениеФайла);
					
				СД_ОбщееВызовСервера.ЗаписатьОшибку(СообщениеОбОшибке,,Ложь);
				Возврат Неопределено;
			КонецЕсли;
			
			АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			
			ДатаФайла=СтрокаПисьма.ДатаОтправления;
			
			УниверсальноеВремя = РаботаСФайламиКлиентСервер.ПолучитьУниверсальноеВремя(ДатаФайла);
			
			ПараметрыРаспознавания = ПолучитьПараметрыРаспознавания();
			
			СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
			СведенияОФайле.АдресВременногоХранилищаФайла = АдресФайла;
			СведенияОФайле.ИмяБезРасширения = СтруктураИмениФайла.ИмяФайлаБезРасширения;
			СведенияОФайле.РасширениеБезТочки = СтруктураИмениФайла.РасширениеФайла;
			СведенияОФайле.Размер = Размер;
			СведенияОФайле.ВремяИзменения = ДатаФайла;
			СведенияОФайле.ВремяИзмененияУниверсальное = УниверсальноеВремя;
			СведенияОФайле.Комментарий = Комментарий;
			СведенияОФайле.ПараметрыРаспознавания = ПараметрыРаспознавания;
			СведенияОФайле.ХранитьВерсии = Истина;
			СведенияОФайле.ЗаписатьВИсторию = Ложь;
			
			НовыйФайл = РаботаСФайламиВызовСервера.СоздатьФайлСВерсией(ПапкаФайла, СведенияОФайле);
			
			//добавим созданный файл в регистр СД_СписокПриложений как значение измерения ОбъектПриложения
			РегСведений=РегистрыСведений.СД_СписокПриложений.СоздатьНаборЗаписей();
			РегСведений.Отбор.ВладелецСсылки.Установить(ЗаявкаСсылка);
			РегСведений.Отбор.ОбъектПриложения.Установить(НовыйФайл);
			РегСведений.Прочитать();
			
			Если РегСведений.Количество()=0 Тогда
				Запись=РегСведений.Добавить();
				Запись.ВладелецСсылки=ЗаявкаСсылка;
				Запись.ОбъектПриложения=НовыйФайл;
				Запись.Информация="Файл из эл. почты";
			Иначе
				Запись=РегСведений[0];
				Запись.Информация="Файл из эл. почты";
			КонецЕсли;
			
			Попытка
				РегСведений.Записать(Истина);
			Исключение
				СД_ОбщееВызовСервера.ЗаписатьОшибку(ОписаниеОшибки(), "Service Desk: Добавление файла в приложение", Ложь);
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//ЗафиксироватьОбработкуПисьма(СтрокаПисьма, УчетнаяЗапись);

	Если НовыйОбъект.Сервис.МоментФормированияТикета=0 Тогда
		ТикетЗаявки=СД_ОбщееВызовСервера.СформироватьТикетПоЗаявке(ЗаявкаСсылка);		
	Иначе
		ТикетЗаявки="";
	КонецЕсли;
	
	//запишем состояние заявки Импорт
	
	СтруктураСостоянияЗаявки=СД_ОбщееВызовСервера.СформироватьСтруктуруСостоянияЗаявки();	
	СтруктураСостоянияЗаявки.СтатусЗаявки=Перечисления.СД_СтатусыЗаявок.Импортирована;
	СтруктураСостоянияЗаявки.ПриоритетЗаявки=Справочники.СД_Приоритет.Средний;
	СтруктураСостоянияЗаявки.ИнициаторЗаявки=ЗаявкаСсылка.ИнициаторЗаявки;
	СтруктураСостоянияЗаявки.ТикетЗаявки=ТикетЗаявки;
	СтруктураСостоянияЗаявки.ДатаЗакрытия=Дата("00010101");
	
	ОснованиеИзмененияСостояния=ЗаявкаСсылка.УчетнаяЗаписьПолученияЗаявки;
	СД_ОбщееВызовСервера.СохранитьСтруктуруСостоянияЗаявки(ЗаявкаСсылка, СтруктураСостоянияЗаявки, ОснованиеИзмененияСостояния, ТекущаяДата()-1);
		
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ЗаявкаСсылка);
	
	ФоновыеЗадания.Выполнить("СД_ОбщееВызовСервера.СтартоватьБизнесПроцессПоЗаявке", 
		ПараметрыЗадания, 
		Новый УникальныйИдентификатор, 
		"Старт процесса тех. поддержки: "+СокрЛП(ЗаявкаСсылка.ТемаЗаявки));
		
	СтруктураСостоянияЗаявки.СтатусЗаявки=Перечисления.СД_СтатусыЗаявок.Отправлена;
	
	//запишем состояние заявки Отправлена
	ОснованиеИзмененияСостояния=ЗаявкаСсылка;
	СД_ОбщееВызовСервера.СохранитьСтруктуруСостоянияЗаявки(ЗаявкаСсылка, СтруктураСостоянияЗаявки, ОснованиеИзмененияСостояния);	
	
	Возврат Истина;

КонецФункции

&Вместо("ЗафиксироватьОбработкуПисьма")
Функция ЧСД_ЗафиксироватьОбработкуПисьма(СтрокаПисьма, УчетнаяЗапись)
	РегистрыСведений.СведенияОПрочтении.УстановитьСведенияОПрочтении(СтрокаПисьма.UID, Истина, СтрокаПисьма.ПользовательПочты);
	// Результат = ПродолжитьВызов(СтрокаПисьма, УчетнаяЗапись);
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура СохранитьСтруктуруСостоянияЗаявки(ЗаявкаСсылка, УстанавливаемыйСтатусЗаявки, ДокументОснование)
	
	СтруктураСостоянияЗаявки=СД_ОбщееВызовСервера.ПрочитатьСтруктуруСостоянияЗаявки(ЗаявкаСсылка);

	//обновим структуру заявки по реквизитам формы документа

	Если СтруктураСостоянияЗаявки.СтатусЗаявки<>УстанавливаемыйСтатусЗаявки	Тогда
		СтруктураСостоянияЗаявки.СтатусЗаявки = УстанавливаемыйСтатусЗаявки;
		//запишем состояние заявки
		СД_ОбщееВызовСервера.СохранитьСтруктуруСостоянияЗаявки(ЗаявкаСсылка, СтруктураСостоянияЗаявки, ДокументОснование);
	КонецЕсли;
	
	
КонецПроцедуры
